{
  "_name_or_path": "klue/roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\ubd84\ub178",
    "1": "\ubd88\uc548",
    "2": "\uc2ac\ud514",
    "3": "\ud3c9\uc628",
    "4": "\ub2f9\ud669",
    "5": "\uae30\uc068"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uae30\uc068": 5,
    "\ub2f9\ud669": 4,
    "\ubd84\ub178": 0,
    "\ubd88\uc548": 1,
    "\uc2ac\ud514": 2,
    "\ud3c9\uc628": 3
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "BertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 32000
}
